In [ ]:
# !pip install mysql-connector

In [1]:
#creating table using code but we already created table manually
import mysql.connector  #importing database
database = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "",
   database = "classpython415")
db = database.cursor()

In [2]:
#selecting rows and view data
db.execute("SELECT * FROM Student")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Rojina Lama', 78, 79, 80, 62, 90, 400, 80.0, 'A')
(2, 'Hari Prasad', 80, 67, 90, 67, 34, 420, 82.0, 'A')
(3, 'ram sharma', 0, 0, 0, 0, 0, 0, 0.0, 'F')
(4, 'ram sharma', 100, 80, 90, 80, 60, 450, 88.0, 'F')

In [3]:
#To select particular column
db.execute("SELECT SN,Name,Total,Grade FROM Student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Rojina Lama', 400, 'A')
(2, 'Hari Prasad', 420, 'A')
(3, 'ram sharma', 0, 'F')
(4, 'ram sharma', 450, 'F')

In [4]:
db.execute("SELECT * FROM Student WHERE Grade = 'A'")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Rojina Lama', 78, 79, 80, 62, 90, 400, 80.0, 'A')
(2, 'Hari Prasad', 80, 67, 90, 67, 34, 420, 82.0, 'A')

In [ ]:
#Insert data
sql = '''INSERT INTO `student` (`SN`, `Name`, `Physics`, `Chemistry`, `Math`, `English`, `Nepali`, `Total`, `Per`, `Grade`)
VALUES ('5', 'riya lama', '50', '70', '80', '88', '60', '409', '82', 'A')''';
db.execute(sql)
database.commit()

In [8]:
Name = input("enter Name = ")
Physics = int(input("enter physics marks = "))
Chemistry = int(input("enter chemistry marks = "))
Math = int(input("enter math marks"))
English = int(input("enter english marks = "))
Nepali = int(input("enter nepali marks = "))
Total = Physics + Chemistry + Math + English + Nepali
Per = Total/5
if per>=80:
    grade = 'A'
elif per>=60:
    grade = 'B'
elif per>=40:
    
    grade = 'C'
else:
    grade = 'F'

sql = f'''INSERT INTO `student` (Name,Physics,Chemistry,Math,English,Nepali,Total,Per,grade)
VALUES ('{Name}',{Physics},{Chemistry},{Math},{English},{Nepali},{Total},{Per},'{grade}')'''
db.execute(sql)
database.commit()

enter Name = rojina lama
enter physics marks = 80
enter chemistry marks = 90
enter math marks88
enter english marks = 70
enter nepali marks = 78

In [6]:
import mysql.connector  #importing database
database = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "",
   database = "classpython415")
db = database.cursor()

In [7]:
db.execute("SELECT * FROM Student")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Rojina Lama', 78, 79, 80, 62, 90, 400, 80.0, 'A')
(2, 'Hari Prasad', 80, 67, 90, 67, 34, 420, 82.0, 'A')
(3, 'ram sharma', 0, 0, 0, 0, 0, 0, 0.0, 'F')
(4, 'ram sharma', 100, 80, 90, 80, 60, 450, 88.0, 'F')
(5, 'riya lama', 50, 70, 80, 88, 60, 409, 82.0, 'A')
(6, 'rojina lama', 80, 90, 88, 70, 78, 406, 81.2, 'A')

In [ ]:
#Insert data
sql = '''INSERT INTO `student` (`SN`, `Name`, `Physics`, `Chemistry`, `Math`, `English`, `Nepali`, `Total`, `Per`, `Grade`)
VALUES ('7', 'paras lama', '51', '72', '83', '88', '62', '415', '82', 'A')''';
db.execute(sql)
database.commit()

In [16]:
#Update
sql = "UPDATE Student SET Name = 'kiki',Grade = 'B' WHERE Name ='Hari Prasad'"
db.execute(sql)
database.commit()

In [14]:
#Delete
sql = "DELETE FROM Student WHERE SN = 6"
db.execute(sql)
database.commit()